---
kind: method
id: M:Autodesk.Revit.DB.DimensionType.GetAlternateUnitsFormatOptions
source: html/81fca2c9-ca3c-0f70-366e-8841944bdac7.htm
---
# Autodesk.Revit.DB.DimensionType.GetAlternateUnitsFormatOptions Method

Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.

## Syntax (C#)
```csharp
public FormatOptions GetAlternateUnitsFormatOptions()
```

## Returns
A copy of the FormatOptions.